LiteOS/LiteOS/hal/GD32F1x0/FWlib/gd32f1x0_rcc.c
/**
  ******************************************************************************
  * @brief   RCC functions of the firmware library.
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "gd32f1x0_rcc.h"

/** @addtogroup GD32F1x0_Firmware
  * @{
  */

/** @defgroup RCC 
  * @brief RCC driver modules
  * @{
  */ 

/** @defgroup RCC_Private_Defines
  * @{
  */
/* ---------------------- RCC registers mask -------------------------------- */
#define  GCCR_HSIEN_SET                        ((uint32_t)0x00000001)    /*!< RCC GCCR_HSIEN mask                              */
#ifdef GD32F170_190
#define  GCFGR_RESET                           ((uint32_t)0x08FF000C)    /*!< RCC GCFGR_Reset mask                             */
#else
#define  GCFGR_RESET                           ((uint32_t)0x083F000C)    /*!< RCC GCFGR_Reset mask                             */
#endif /* GD32F170_190 */
#define  GCCR_HSEEN_CKMEN_PLLEN_RESET          ((uint32_t)0xFEF6FFFF)    /*!< RCC GCCR_HSEEN_CKMEN_PLLEN mask                  */
#define  GCCR_HSEBPS_RESET                     ((uint32_t)0xFFFBFFFF)    /*!< RCC GCCR_HSEBPS mask                             */
#define  GCFGR_PLLSEL_PLLPREDV_PLLMF_RESET     ((uint32_t)0xF7C0FFFF)    /*!< RCC GCFGR_PLLSEL_PLLPREDV_PLLMF mask             */
#define  GCFGR2_HSEPREDIV_RESET                ((uint32_t)0xFFFFFFF0)    /*!< RCC GCFGR2_HSEPREDIV mask                        */
#define  GCFGR3_USART1SEL_CECSEL_ADCSEL_RESET   ((uint32_t)0xFFFFFEBC)   /*!< RCC GCFGR3_USART1SEL_CECSEL_ADCSEL mask          */
#ifdef GD32F170_190/* GD32F170_190 */
#define  GCCR2_HSI28_RESET                     ((uint32_t)0xFFFFFFFE)    /*!< RCC GCCR2_HSI28 mask                             */
#define  GCCR2_HSI28ADJ_OFFSET                 ((uint32_t)0x00000003)    /*!< RCC GCCR2_HSI28ADJ offset                        */
#define  GCFGR3_HSI28ADC_OFFSET                ((uint32_t)0x00000010)    /*!< RCC GCFGR3_HSI28ADC mask                         */
#else
#define  GCCR2_HSI14_RESET                     ((uint32_t)0xFFFFFFFE)    /*!< RCC GCCR2_HSI14 mask                             */
#define  GCCR2_HSI14ADJ_OFFSET                 ((uint32_t)0x00000003)    /*!< RCC GCCR2_HSI14ADJ mask                          */
#define  GCFGR3_HSI14ADC_OFFSET                ((uint32_t)0x00000010)    /*!< RCC GCFGR3_HSI14ADC mask                         */
#endif /* GD32F170_190 */
#define  GCIR_INT_RESET                        ((uint32_t)0x00000000)    /*!< RCC GCIR_INT mask                                */
#define  GCCR_HSIADJ_OFFSET                    ((uint32_t)0x00000003)    /*!< RCC GCCR_HSIADJ mask                             */
#define  GCCR_BYTE2_ADDRESS                    ((uint32_t)0x40021002)    /*!< GCCR register byte 2 (Bits[23:16]) base address  */
#define  GCFGR_BYTE3_ADDRESS                   ((uint32_t)0x40021007)    /*!< GCFGR register byte 3 (Bits[31:23]) base address */
#define  GCIR_BYTE1_ADDRESS                    ((uint32_t)0x40021009)    /*!< GCIR register byte 1 (Bits[15:8]) base address   */
#define  GCIR_BYTE2_ADDRESS                    ((uint32_t)0x4002100A)    /*!< GCIR register byte 2 (Bits[23:16]) base address  */
#define  FLAG_MASK                             ((uint8_t )0x1F)          /*!< RCC flag mask                                    */
#define  HSI_CLOCK_DIVIDED_2                   ((uint32_t)0x00000001)    /*!< RCC HSI clock divided by 2 mask                  */
#define  RCC_VC_KEY_ULOCKPOWER                 ((uint32_t)0x1A2B3C4D)    /*!< RCC RCC_VC_KEY_ULOCKPOWER mask                   */
#define  RCC_VC_KEY_CLEAR                      ((uint32_t)0x00000000)    /*!< RCC RCC_VC_KEY_CLEAR mask                        */
#define  RCC_GCFGR_PLLMF_3_0                   ((uint32_t)0x003C0000)    /*!< PLLMF[3:0] bits                                  */
#ifdef GD32F170_190
#define  GCFGR4_CKOUT2DIV_CKOUT2SRC_RESET      ((uint32_t)0xFFFFC0F8)    /*!< RCC GCFGR4_CKOUT2DIV_CKOUT2SRC mask              */
#define  RCC_GCFGR4_CKOUT2DIV_OFFSET           ((uint32_t)0x00000008)    /*!< RCC_GCFGR4_CKOUT2DIV offset                      */
#endif /* GD32F170_190 */

static __I uint8_t AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
static __I uint8_t APBPrescTable[8] = {0, 0, 0, 0, 1, 2, 3, 4};

/**
  * @}
  */

/** @defgroup RCC_Private_Functions
  * @{
  */

/**
  * @brief  Reset the RCC clock configuration.
  * @param  None
  * @retval None
  */
void RCC_DeInit(void)
{
    /* Set RCC GCCR_HSIEN mask */
    RCC->GCCR |= GCCR_HSIEN_SET;
    
    /* Reset SCS[1:0], AHBPS[3:0], APB1PS[2:0],APB2PS[2:0], ADCPS[1:0], USBPS[1:0], CKOTUSRC[2:0], CKOUTDIV, and PLLDV bits*/
    RCC->GCFGR &= GCFGR_RESET;
    
    /* Reset HSEEN, CKMEN and PLLEN bits */
    RCC->GCCR &= GCCR_HSEEN_CKMEN_PLLEN_RESET;
    
    /* Reset HSEBPS bit */
    RCC->GCCR &= GCCR_HSEBPS_RESET;
    
    /* Reset PLLSEL, PLLPREDV and PLLMF[4:0] bits */
    RCC->GCFGR &= GCFGR_PLLSEL_PLLPREDV_PLLMF_RESET;
    
    /* Reset HSEPREDIV[3:0] bits */
    RCC->GCFGR2 &= GCFGR2_HSEPREDIV_RESET;
    
    /* Reset USARTSEL[1:0], CECSEL and ADCSEL bits */
    RCC->GCFGR3 &= GCFGR3_USART1SEL_CECSEL_ADCSEL_RESET;

#ifdef GD32F170_190
    /* Reset HSI28 bit */
    RCC->GCCR2 &= GCCR2_HSI28_RESET;
#else
    /* Reset HSI14 bit */
    RCC->GCCR2 &= GCCR2_HSI14_RESET;
#endif /* GD32F170_190 */

    /* Disable all interrupts */
    RCC->GCIR = GCIR_INT_RESET;
    
#ifdef GD32F170_190
    /* Reset CKOUT2DIV[5:0], CKOUT2SRC[2:0] */
    RCC->GCFGR4 = GCFGR4_CKOUT2DIV_CKOUT2SRC_RESET;
#endif /* GD32F170_190 */
}

/**
  * @brief  Configure the External High Speed oscillator (HSE).
  * @param  RCC_HSE: specify the new state of HSE.
  *   This parameter can be one of the following values:
  *     @arg RCC_HSE_OFF: turn off the HSE
  *     @arg RCC_HSE_ON: turn on the HSE
  *     @arg RCC_HSE_BYPASS: HSE bypassed with external clock
  * @retval None
  */
void RCC_HSEConfig(uint8_t RCC_HSE)
{
    /* Reset HSEEN and HSESTB bits */
    *(__IO uint8_t *) GCCR_BYTE2_ADDRESS = RCC_HSE_OFF;
    
    /* Set the new state of HSE */
    *(__IO uint8_t *) GCCR_BYTE2_ADDRESS = RCC_HSE;
}

/**
  * @brief  Wait for HSE start-up.
  * @param  None
  * @retval The HSE start-up result(SUCCESS or ERROR)
  */
TypeState RCC_WaitForHSEStartUp(void)
{
    __IO uint32_t HSE_StartOk_Counter = 0;
    TypeState HSEState = RESET;
    
    /* Wait until HSE is ready and if timeout to exit */
    while((HSE_StartOk_Counter != HSE_STARTUP_TIMEOUT) && (HSEState == RESET))
    {
        HSEState = RCC_GetBitState(RCC_FLAG_HSESTB);
        HSE_StartOk_Counter++;  
    }
    
    if(RCC_GetBitState(RCC_FLAG_HSESTB) != RESET)
    {
        return SUCCESS;
    }
    else
    {
        return ERROR;
    }
}

/**
  * @brief  Adjust the Internal High Speed oscillator (HSI) calibration value.
  * @param  HSICalibrationValue: the HSI calibration value.
  *   This parameter must be between 0 and 0x1F.
  * @retval None
  */
void RCC_AdjustHSICalibrationValue(uint8_t HSICalibrationValue)
{
    uint32_t temp_adjust = 0;
    
    temp_adjust = RCC->GCCR;
    
