LiteOS/LiteOS/hal/GD32F1x0/FWlib/gd32f1x0_rcc.c
    /* Clear HSIADJ[4:0] bits */
    temp_adjust &= ~RCC_GCCR_HSIADJ;
    
    /* Set HSIADJ[4:0] bits according to HSICalibrationValue value */
    temp_adjust |= (uint32_t)HSICalibrationValue << GCCR_HSIADJ_OFFSET ;
    
    /* Store the calibration value */
    RCC->GCCR = temp_adjust;
}

/**
  * @brief  Enable or disable the Internal High Speed oscillator (HSI).
  * @param  NewValue: new value of the HSI.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_HSI_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->GCCR |= RCC_GCCR_HSIEN;
    }
    else
    {
        RCC->GCCR &= ~RCC_GCCR_HSIEN;
    }
}

#ifdef GD32F170_190
/**
  * @brief  Adjust the Internal High Speed oscillator (HSI28) calibration value.
  * @param  HSI28CalibrationValue: the HSI28 calibration value.
  *   This parameter must be  between 0 and 0x1F.
  * @retval None
  */
void RCC_AdjustHSI28CalibrationValue(uint8_t HSI28CalibrationValue)
{
    uint32_t temp_adjust = 0;
    
    temp_adjust = RCC->GCCR2;
    
    /* Reset HSI28ADJ[4:0] bits */
    temp_adjust &= ~RCC_GCCR2_HSI28ADJ;
    
    /* Set the HSI28ADJ[4:0] bits according to HSI28CalibrationValue value */
    temp_adjust |= (uint32_t)HSI28CalibrationValue << GCCR2_HSI28ADJ_OFFSET ;
    
    /* Store the calibration value */
    RCC->GCCR2 = temp_adjust;
}

/**
  * @brief  Enable or disable the Internal High Speed oscillator(HSI28).
  * @param  NewValue: new value of the HSI.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_HSI28_Enable(TypeState NewValue)
{
    if(NewValue != DISABLE)
    {
        RCC->GCCR2 |= RCC_GCCR2_HSI28EN;
    }
    else
    {
        RCC->GCCR2 &= ~RCC_GCCR2_HSI28EN;
    }
}
#else
/**
  * @brief  Adjust the Internal High Speed oscillator (HSI14) calibration value.
  * @param  HSI14CalibrationValue: the HSI14 calibration value.
  *   This parameter must be  between 0 and 0x1F.
  * @retval None
  */
void RCC_AdjustHSI14CalibrationValue(uint8_t HSI14CalibrationValue)
{
    uint32_t temp_adjust = 0;
    
    temp_adjust = RCC->GCCR2;
    
    /* Reset HSI14ADJ[4:0] bits */
    temp_adjust &= ~RCC_GCCR2_HSI14ADJ;
    
    /* Set the HSI14ADJ[4:0] bits according to HSI14CalibrationValue value */
    temp_adjust |= (uint32_t)HSI14CalibrationValue << GCCR2_HSI14ADJ_OFFSET ;
    
    /* Store the calibration value */
    RCC->GCCR2 = temp_adjust;
}

/**
  * @brief  Enable or disable the Internal High Speed oscillator(HSI14).
  * @param  NewValue: new value of the HSI.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_HSI14_Enable(TypeState NewValue)
{
    if(NewValue != DISABLE)
    {
        RCC->GCCR2 |= RCC_GCCR2_HSI14EN;
    }
    else
    {
        RCC->GCCR2 &= ~RCC_GCCR2_HSI14EN;
    }
}
#endif /* GD32F170_190 */

/**
  * @brief  Configure the External Low Speed oscillator (LSE).
  * @param  RCC_LSE: specify the new state of the LSE.
  *   This parameter can be one of the following values:
  *     @arg RCC_LSE_OFF: turn off the LSE 
  *     @arg RCC_LSE_EN: turn on the LSE 
  *     @arg RCC_LSE_Bypass: LSE bypassed with external clock
  * @retval None
  */
void RCC_LSEConfig(uint32_t RCC_LSE)
{
    /* Reset LSEEN and LSEBPS bits before configuring the LSE */
    RCC->BDCR &= ~(RCC_BDCR_LSEEN);
    RCC->BDCR &= ~(RCC_BDCR_LSEBPS);
    
    /* Configure LSE */
    RCC->BDCR |= RCC_LSE;
}

/**
  * @brief  Configure the External Low Speed oscillator (LSE) drive capability.
  * @param  RCC_LSEDrive: specify the new state of the LSE drive capability.
  *   This parameter can be one of the following values:
  *     @arg RCC_LSEDRIVE_LOW: LSE low drive capability.
  *     @arg RCC_LSEDRIVE_MEDIUMLOW: LSE medium low drive capability.
  *     @arg RCC_LSEDRIVE_MEDIUMHIGH: LSE medium high drive capability.
  *     @arg RCC_LSEDRIVE_HIGH: LSE high drive capability.
  * @retval None
  */
void RCC_LSEDriveConfig(uint32_t RCC_LSEDrive)
{
    /* Clear LSEDRI[1:0] bits */
    RCC->BDCR &= ~(RCC_BDCR_LSEDRI);
    
    /* Set the LSE drive capability */
    RCC->BDCR |= RCC_LSEDrive;
}

/**
  * @brief  Enable or disable the Internal Low Speed oscillator (LSI).
  * @param  NewValue: new value of the LSI.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_LSI_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->GCSR |= RCC_GCSR_LSIEN;
    }
    else
    {
        RCC->GCSR &= ~RCC_GCSR_LSIEN;
    }
}

/**
  * @brief  Configure the PLL clock source and multiplication factor.
  * @param  RCC_PLLSelect: specify the PLL clock source.
  *   This parameter can be one of the following values:
  *     @arg RCC_PLLSOURCE_HSI_DIV2: HSI divided by 2 selected as PLL clock source
  *     @arg RCC_PLLSOURCE_HSEPREDIV: HSE selected as PLL clock source
  * @note   if using HSE as PLL source, the minimum clock frequency for PLL is 2 MHz.
  * @param  RCC_PLLMF: specify the PLL multiplication factor,  RCC_PLLMUL_x where x:[2,32] 
  * @retval None
  */
void RCC_PLLConfig(uint32_t RCC_PLLSelect, uint32_t RCC_PLLMF)
{
    /* Clear PLLSEL [16] and PLLMF [27] [21:18] bits */
    RCC->GCFGR &= ~(RCC_GCFGR_PLLMF | RCC_GCFGR_PLLSEL);
    
    /* Set the PLLSEL and PLLMF */
    RCC->GCFGR |= (uint32_t)(RCC_PLLSelect | RCC_PLLMF);
}

/**
  * @brief  Enable or disable the PLL.
  * @param  NewValue: new value of the PLL.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_PLL_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->GCCR |= RCC_GCCR_PLLEN;
    }
    else
    {
        RCC->GCCR &= ~RCC_GCCR_PLLEN;
    }
}

/**
  * @brief  Configure the HSEPREDV division factor.
  * @param  RCC_HSEPREDV1_Div: specify the HSE division factor.
  *   This parameter can be RCC_HSEPREDV1_DIVx where x:[1,16]
  * @retval None
  */
void RCC_HSEPREDVConfig(uint32_t RCC_HSEPREDV1_Div)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR2;
    /* Clear HSEPREDV[3:0] bits */
    temp &= ~(RCC_GCFGR2_HSEPREDV1);
    /* Set the HSEPREDV division factor */
    temp |= RCC_HSEPREDV1_Div;
    /* Store the new value */
    RCC->GCFGR2 = temp;
}

/**
  * @brief  Enable or disable the Clock Security System.
  * @param  NewValue: new value of the Clock Security System.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_HSEClockMonitor_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->GCCR |= RCC_GCCR_CKMEN;
    }
    else
    {
        RCC->GCCR &= ~RCC_GCCR_CKMEN;
    }
}

/**
  * @brief  Select the clock source to output on CKOUTSRC and the corresponding prescaler.
  * @param  RCC_CKOUTSRC: specify the clock source to output.
  *
  *   For @b GD32F130 or GD32F150 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_CKOUTSRC_NOCLOCK: No clock selected.
  *     @arg RCC_CKOUTSRC_HSI14: selecte HSI14 to output.
  *     @arg RCC_CKOUTSRC_LSI: selecte LSI to output.
  *     @arg RCC_CKOUTSRC_LSE: selecte LSE to output.
  *     @arg RCC_CKOUTSRC_SYSCLK: selecte System clock to output.
  *     @arg RCC_CKOUTSRC_HSI: selecte HSI to output.
  *     @arg RCC_CKOUTSRC_HSE: selecte HSE to output.
  *     @arg RCC_CKOUTSRC_PLLCLK_DIV2: PLL clock divided by 2 selecte.
  *     @arg RCC_CKOUTSRC_PLLCLK_DIV1: PLL clock selected.
  *
  *   For @b GD32F170 or GD32F190 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_CKOUTSRC_NOCLOCK: No clock selected.
  *     @arg RCC_CKOUTSRC_HSI28: selecte HSI28 to output.
  *     @arg RCC_CKOUTSRC_LSI: selecte LSI to output.
  *     @arg RCC_CKOUTSRC_LSE: selecte LSE to output.
  *     @arg RCC_CKOUTSRC_SYSCLK: selecte System clock to output.
  *     @arg RCC_CKOUTSRC_HSI: selecte HSI to output.
  *     @arg RCC_CKOUTSRC_HSE: selecte HSE to output.
  *     @arg RCC_CKOUTSRC_PLLCLK_DIV2: PLL clock divided by 2 selecte.
  *     @arg RCC_CKOUTSRC_PLLCLK_DIV1: PLL clock selected.
  *
  * @param  RCC_CKOUTDIV: specify the corresponding prescaler on CKOUTSRC.
  *   This parameter can be one of the following values:
  *     @arg RCC_CKOUTDIV_1: CK_OUT clock is divided by 1.
  *     @arg RCC_CKOUTDIV_2: CK_OUT clock is divided by 2.
  *     @arg RCC_CKOUTDIV_4: CK_OUT clock is divided by 4.
  *     @arg RCC_CKOUTDIV_8: CK_OUT clock is divided by 8.
  *     @arg RCC_CKOUTDIV_16: CK_OUT clock is divided by 16.
  *     @arg RCC_CKOUTDIV_32: CK_OUT clock is divided by 32.
  *     @arg RCC_CKOUTDIV_64: CK_OUT clock is divided by 64.
  *     @arg RCC_CKOUTDIV_128: CK_OUT clock is divided by 128.    
  * @retval None
  */
void RCC_CKOUTSRCConfig(uint32_t RCC_CKOUTSRC, uint32_t RCC_CKOUTDIV)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR;
    /* Clear CKOUTSRC[2:0] bits */
    temp &= ~(RCC_GCFGR_CKOUTDIV | RCC_GCFGR_CKOUTSRC | RCC_GCFGR_PLLDV);
    /* Set the RCC_CKOUTSRC and RCC_CKOUTDIV */
    temp |= (RCC_CKOUTDIV | RCC_CKOUTSRC);
    /* Store the new value */
    RCC->GCFGR = temp;
}

