LiteOS/LiteOS/hal/GD32F1x0/FWlib/gd32f1x0_rcc.c
#ifdef GD32F170_190
/**
  * @brief  Select the clock source to output on CKOUT2SRC and the corresponding prescaler.
  * @param  RCC_CKOUT2SRC: specify the clock source to output.
  *   This parameter can be one of the following values:
  *     @arg RCC_CKOUT2SRC_NOCLOCK: No clock selected.
  *     @arg RCC_CKOUT2SRC_HSI28: selecte HSI28 to output.
  *     @arg RCC_CKOUT2SRC_LSI: selecte LSI to output.
  *     @arg RCC_CKOUT2SRC_LSE: selecte LSE to output.
  *     @arg RCC_CKOUT2SRC_SYSCLK: selecte System clock to output.
  *     @arg RCC_CKOUT2SRC_HSI: selecte HSI to output.
  *     @arg RCC_CKOUT2SRC_HSE: selecte HSE to output.
  *     @arg RCC_CKOUT2SRC_PLLCLK_DIV2: PLL clock divided by 2 selecte.
  *     @arg RCC_CKOUT2SRC_PLLCLK_DIV1: PLL clock selected.
  * @param  RCC_CKOUT2DIV: specify the corresponding prescaler on CKOUT2SRC.
  *   This parameter can be one of 1 to 64:
  * @retval None
  */
void RCC_CKOUT2SRCConfig(uint32_t RCC_CKOUT2SRC, uint32_t RCC_CKOUT2DIV)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR4;
    /* Clear CKOUT2SRC[2:0], CKOUT2DIV[5:0] bits */
    temp &= ~(RCC_GCFGR4_CKOUT2SRC | RCC_GCFGR4_CKOUT2DIV);
    
    /* if the RCC_CKOUT2SRC is PLL, set the PLLDV of RCC->GCFGR*/
    if(RCC_CKOUT2SRC == RCC_CKOUT2SRC_PLLCLK_DIV2)
    {
        RCC->GCFGR &= ~RCC_GCFGR_PLLDV;
        RCC_CKOUT2SRC = RCC_GCFGR4_CKOUT2SRC_PLL;
    }
    else if(RCC_CKOUT2SRC == RCC_CKOUT2SRC_PLLCLK_DIV1)
    {
        RCC->GCFGR |= RCC_GCFGR_PLLDV;
        RCC_CKOUT2SRC = RCC_GCFGR4_CKOUT2SRC_PLL; 
    }
    
    /* Set the RCC_CKOUT2SRC and RCC_CKOUT2DIV */
    temp |= (((RCC_CKOUT2DIV - 1) << RCC_GCFGR4_CKOUT2DIV_OFFSET) | RCC_CKOUT2SRC);
    /* Store the new value */
    RCC->GCFGR4 = temp;
}
#endif /* GD32F170_190 */

/**
  * @brief  Configure the system clock (CK_SYS) 
  * @param  RCC_SYSCLKSource: specify the system clock source 
  *   This parameter can be one of the following values:
  *     @arg RCC_SYSCLKSOURCE_HSI:    selecte HSI as CK_SYS source
  *     @arg RCC_SYSCLKSOURCE_HSE:    selecte HSE as CK_SYS source
  *     @arg RCC_SYSCLKSOURCE_PLLCLK: selecte PLL as CK_SYS source
  * @retval None
  */
void RCC_CK_SYSConfig(uint32_t RCC_SYSCLKSource)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR;
    
    /* Clear SCS[1:0] bits */
    temp &= ~RCC_GCFGR_SCS;
    
    /* Set SCS[1:0] bits according to RCC_SYSCLKSource value */
    temp |= RCC_SYSCLKSource;
    
    /* Store the new value */
    RCC->GCFGR = temp;
}

/**
  * @brief  Get the system clock source.
  * @param  None
  * @retval Get the system clock source. The returned value can be one 
  *         of the following values:
  *           - 0x00: HSI used as CK_SYS source
  *           - 0x04: HSE used as CK_SYS source  
  *           - 0x08: PLL used as CK_SYS source
  */
uint8_t RCC_GetCK_SYSSource(void)
{
    return ((uint8_t)(RCC->GCFGR & RCC_GCFGR_SCSS));
}

/**
  * @brief  Configure the AHB clock.
  * @param  RCC_CK_SYSDiv: specify the AHB clock divider. This clock is derived from 
  *         the system clock (CK_SYS).
  *   This parameter can be one of the following values:
  *     @arg RCC_SYSCLK_DIV1:   AHB clock = CK_SYS
  *     @arg RCC_SYSCLK_DIV2:   AHB clock = CK_SYS/2
  *     @arg RCC_SYSCLK_DIV4:   AHB clock = CK_SYS/4
  *     @arg RCC_SYSCLK_DIV8:   AHB clock = CK_SYS/8
  *     @arg RCC_SYSCLK_DIV16:  AHB clock = CK_SYS/16
  *     @arg RCC_SYSCLK_DIV64:  AHB clock = CK_SYS/64
  *     @arg RCC_SYSCLK_DIV128: AHB clock = CK_SYS/128
  *     @arg RCC_SYSCLK_DIV256: AHB clock = CK_SYS/256
  *     @arg RCC_SYSCLK_DIV512: AHB clock = CK_SYS/512
  * @retval None
  */
void RCC_AHBConfig(uint32_t RCC_CK_SYSDiv)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR;
    
    /* Clear AHBPS[3:0] bits */
    temp &= ~RCC_GCFGR_AHBPS;
    
    /* Set AHBPS[3:0] bits according to RCC_CK_SYSDiv value */
    temp |= RCC_CK_SYSDiv;
    
    /* Store the new value */
    RCC->GCFGR = temp;
}

/**
  * @brief  Configure the APB1 clock.
  * @param  RCC_APB1: specify the APB1 clock divider. This clock is derived from 
  *         the AHB clock.
  *   This parameter can be one of the following values:
  *     @arg RCC_APB1AHB_DIV1: APB1 clock = AHB
  *     @arg RCC_APB1AHB_DIV2: APB1 clock = AHB/2
  *     @arg RCC_APB1AHB_DIV4: APB1 clock = AHB/4
  *     @arg RCC_APB1AHB_DIV8: APB1 clock = AHB/8
  *     @arg RCC_APB1AHB_DIV16: APB1 clock = AHB/16
  * @retval None
  */
void RCC_APB1Config(uint32_t RCC_APB1)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR;
    
    /* Clear APB1PS[2:0] bits */
    temp &= ~RCC_GCFGR_APB1PS;
    
    /* Set APB1PS[2:0] bits according to RCC_APB1 value */
    temp |= RCC_APB1;
    
    /* Store the new value */
    RCC->GCFGR = temp;
}

/**
  * @brief  Configure the APB2 clock.
  * @param  RCC_APB2: specify the APB2 clock divider. This clock is derived from 
  *         the AHB clock.
  *   This parameter can be one of the following values:
  *     @arg RCC_APB2AHB_DIV1: APB2 clock = AHB
  *     @arg RCC_APB2AHB_DIV2: APB2 clock = AHB/2
  *     @arg RCC_APB2AHB_DIV4: APB2 clock = AHB/4
  *     @arg RCC_APB2AHB_DIV8: APB2 clock = AHB/8
  *     @arg RCC_APB2AHB_DIV16: APB2 clock = AHB/16
  * @retval None
  */
void RCC_APB2Config(uint32_t RCC_APB2)
{
    uint32_t temp = 0;
    
    temp = RCC->GCFGR;
    
    /* Clear APB2PS[2:0] bits */
    temp &= ~RCC_GCFGR_APB2PS;
    
    /* Set APB2PS[2:0] bits according to RCC_APB2 value */
    temp |= RCC_APB2;
    
    /* Store the new value */
    RCC->GCFGR = temp;
}

/**
  * @brief  Configure the ADC clock (ADCCLK).
  * @param  RCC_ADCCLK: specify the ADC clock source.
  *
  *   For @b GD32F130 or GD32F150 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_ADCCLK_HSI14: ADC clock = HSI14 (14MHz)
  *     @arg RCC_ADCCLK_APB2_DIV2: ADC clock = APB2/2
  *     @arg RCC_ADCCLK_APB2_DIV4: ADC clock = APB2/4
  *     @arg RCC_ADCCLK_APB2_DIV6: ADC clock = APB2/6
  *     @arg RCC_ADCCLK_APB2_DIV8: ADC clock = APB2/8 
  *
  *   For @b GD32F170 or GD32F190 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_ADCCLK_HSI28_DIV2: ADC clock = HSI28/2 (14MHz)
  *     @arg RCC_ADCCLK_HSI28: ADC clock = HSI28 (28MHz)
  *     @arg RCC_ADCCLK_APB2_DIV2: ADC clock = APB2/2
  *     @arg RCC_ADCCLK_APB2_DIV4: ADC clock = APB2/4
  *     @arg RCC_ADCCLK_APB2_DIV6: ADC clock = APB2/6
  *     @arg RCC_ADCCLK_APB2_DIV8: ADC clock = APB2/8
  *  
  * @retval None
  */
void RCC_ADCCLKConfig(uint32_t RCC_ADCCLK)
{ 
    /* Clear ADCPS bit */
    RCC->GCFGR &= ~RCC_GCFGR_ADCPS;
    /* Set ADCPS bits according to RCC_APB2 value */
    RCC->GCFGR |= RCC_ADCCLK & 0xFFFF;
    
