LiteOS/LiteOS/hal/GD32F1x0/FWlib/gd32f1x0_rcc.c
#ifdef GD32F170_190
    /* Clear ADCSEL , HSI28DIV bit */
    RCC->GCFGR3 &= ~(RCC_GCFGR3_ADCSEL | RCC_GCFGR3_HSI28DIV); 
    
    /* if RCC_ADCCLK is RCC_ADCCLK_HSI28, set RCC_GCFGR3_HSI28DIV*/
    if(RCC_ADCCLK  == RCC_ADCCLK_HSI28)
    {
        RCC->GCFGR3 |= RCC_GCFGR3_HSI28DIV;
        RCC_ADCCLK = RCC_ADCCLK_HSI28_DIV2;
    }
    
    /* Set ADCSEL bits according to RCC_ADCCLK value */
    RCC->GCFGR3 |= RCC_ADCCLK >> GCFGR3_HSI28ADC_OFFSET;
#else
    /* Clear ADCSEL bit */
    RCC->GCFGR3 &= ~RCC_GCFGR3_ADCSEL; 
    /* Set ADCSEL bits according to RCC_ADCCLK value */
    RCC->GCFGR3 |= RCC_ADCCLK >> GCFGR3_HSI14ADC_OFFSET;
#endif /* GD32F170_190 */    
}

#ifdef GD32F130_150
/**
  * @brief  Configure the USB clock (USBCLK).
  * @param  RCC_USBCLK: specify the USB clock source. This clock is derived 
  *         from the PLL.
  *   This parameter can be one of the following values:
  *     @arg RCC_USBCLK_PLL_DIV1_5: USB clock = PLL/1.5
  *     @arg RCC_USBCLK_PLL_DIV1: USB clock = PLL
  *     @arg RCC_USBCLK_PLL_DIV2: USB clock = PLL/2
  *     @arg RCC_USBCLK_PLL_DIV2_5: USB clock = PLL/2.5
  * @retval None
  */
void RCC_USBCLKConfig(uint32_t RCC_USBCLK)
{ 
    /* Clear USBPS bit */
    RCC->GCFGR &= ~RCC_GCFGR_USBPS;
    /* Set USBPS bits according to RCC_USBCLK value */
    RCC->GCFGR |= RCC_USBCLK;
}
#endif /* GD32F130_150 */

/**
  * @brief  Configure the CEC clock (CECCLK).
  * @param  RCC_CECCLK: specify the CEC clock source. This clock is derived 
  *         from the HSI or LSE clock.
  *   This parameter can be one of the following values:
  *     @arg RCC_CECCLK_HSI_DIV244: CEC clock = HSI/244 (32768Hz)
  *     @arg RCC_CECCLK_LSE: CEC clock = LSE
  * @retval None
  */
void RCC_CECCLKConfig(uint32_t RCC_CECCLK)
{ 
    /* Clear CECSEL bit */
    RCC->GCFGR3 &= ~RCC_GCFGR3_CECSEL;
    /* Set CECSEL bits according to RCC_CECCLK value */
    RCC->GCFGR3 |= RCC_CECCLK;
}

/**
  * @brief  Configure the USART1 clock (USART1CLK).
  * @param  RCC_USARTCLK: specify the USART1 clock source. 
  *   This parameter can be one of the following values:
  *     @arg RCC_USART1CLK_APB2: USART1 clock = APB2 Clock
  *     @arg RCC_USART1CLK_CK_SYS: USART1 clock = CK_SYS Clock
  *     @arg RCC_USART1CLK_LSE: USART1 clock = LSE Clock
  *     @arg RCC_USART1CLK_HSI: USART1 clock = HSI Clock
  * @retval None
  */
void RCC_USARTCLKConfig(uint32_t RCC_USARTCLK)
{ 
    /* Clear USART1SEL[1:0] bit */
    RCC->GCFGR3 &= ~RCC_GCFGR3_USART1SEL;
    /* Set USART1SEL bits according to RCC_USARTCLK value */
    RCC->GCFGR3 |= RCC_USARTCLK;
}

/**
  * @brief  Configure the RTC clock (RTCCLK).           
  * @param  RCC_RTCCLKSource: specify the RTC clock source.
  *   This parameter can be one of the following values:
  *     @arg RCC_RTCCLKSource_LSE: selecte LSE as RTC clock
  *     @arg RCC_RTCCLKSource_LSI: selecte LSI as RTC clock
  *     @arg RCC_RTCCLKSource_HSE_DIV32: selecte HSE divided by 32 as RTC clock         
  * @note   if using HSE as RTC source, the maximum clock frequency for RTC is 2 MHz.                     
  * @retval None
  */
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource)
{
    /* Select the RTC clock source */
    RCC->BDCR |= RCC_RTCCLKSource;
}

/**
  * @brief  Get the frequencies of the CK_SYS, AHB, APB1, APB2, ADC, CEC and USART1 clocks.    
  * @retval None
  */
void RCC_GetClocksFreq(RCC_ClocksPara* RCC_Clocks)
{
    uint32_t temp = 0, pllmf = 0, pllmf4=0,pllselect = 0, prediv1factor = 0, presc = 0;
    
    /* Get CK_SYS source -------------------------------------------------------*/
    temp = RCC->GCFGR & RCC_GCFGR_SCSS;
    
    switch (temp)
    {
        case 0x00:  /* HSI used as CK_SYS */
        RCC_Clocks->CK_SYS_Frequency = HSI_VALUE;
        break;
        case 0x04:  /* HSE used as CK_SYS */
        RCC_Clocks->CK_SYS_Frequency = HSE_VALUE;
        break;
        case 0x08:  /* PLL used as CK_SYS */
        /* Get PLL clock source and multiplication factor ----------------------*/
        /* Get PLLMF[3:0] */
        pllmf = RCC->GCFGR & RCC_GCFGR_PLLMF_3_0;
        /* Get PLLMF[4] */
        pllmf4 = RCC->GCFGR & RCC_GCFGR_PLLMF_4;
        pllmf4 = (( pllmf4 >> 27)*16);
        
        pllmf = ( pllmf >> 18) + pllmf4;
        
        if(pllmf >= 0x0F)
        {
            pllmf += 1;
        }
        else
        {
            pllmf += 2;
        }
        pllselect = RCC->GCFGR & RCC_GCFGR_PLLSEL;
        if (pllselect == 0x00)
        {
            /* HSI clock divided by 2 selected as PLL clock source */
            RCC_Clocks->CK_SYS_Frequency = (HSI_VALUE >>HSI_CLOCK_DIVIDED_2) * pllmf;
        }
        else
        {
            /*Get the HSEPREDV division factor */
            prediv1factor = (RCC->GCFGR2 & RCC_GCFGR2_HSEPREDV1) + 1;
            /* HSE clock selected as PLL clock source */
            RCC_Clocks->CK_SYS_Frequency = (HSE_VALUE / prediv1factor) * pllmf; 
        }      
        break;
        default: /* HSI used as system clock */
        RCC_Clocks->CK_SYS_Frequency = HSI_VALUE;
        break;
    }
    
    /* Get AHB prescaler */
    temp = RCC->GCFGR & RCC_GCFGR_AHBPS;
    temp = temp >> 4;
    presc = AHBPrescTable[temp]; 
    /* Get AHB clock frequency */
    RCC_Clocks->AHB_Frequency = RCC_Clocks->CK_SYS_Frequency >> presc;
    
    /* Get APB1 prescaler */
    temp = RCC->GCFGR & RCC_GCFGR_APB1PS;
    temp = temp >> 8;
    presc = APBPrescTable[temp];
    /* Get APB1 clock frequency */
    RCC_Clocks->APB1_Frequency = RCC_Clocks->AHB_Frequency >> presc;
    
    /* Get APB2 prescaler */
    temp = RCC->GCFGR & RCC_GCFGR_APB2PS;
    temp = temp >> 11;
    presc = APBPrescTable[temp];
    /* Get APB2 clock frequency */
    RCC_Clocks->APB2_Frequency = RCC_Clocks->AHB_Frequency >> presc;
    
    /* Get ADCCLK clock frequency */
    if((RCC->GCFGR3 & RCC_GCFGR3_ADCSEL) != RCC_GCFGR3_ADCSEL)
    {        
#ifdef GD32F170_190
        if((RCC->GCFGR3 & RCC_GCFGR3_HSI28DIV) != RCC_GCFGR3_HSI28DIV)
        {
            /* ADC Clock clock is derived from the HSI28 / 2 */
            RCC_Clocks->ADCCLK_Frequency = HSI28_VALUE / 2;
        }
        else
        {
            /* ADC Clock clock is derived from the HSI28 */
            RCC_Clocks->ADCCLK_Frequency = HSI28_VALUE;
        }
#else        
        /* ADC Clock clock is derived from the HSI14 */
        RCC_Clocks->ADCCLK_Frequency = HSI14_VALUE;
#endif /* GD32F170_190 */
    }
    else
    {
        temp = ((RCC->GCFGR & RCC_GCFGR_ADCPS) >>14 );
        switch (temp)
        {
            case 0: /* ADC Clock is derived from APB2/2 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /2);
            break;
            case 1: /* ADC Clock is derived from APB2/4 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /4);
            break;
            case 2: /* ADC Clock is derived from APB2/6 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /6);
            break;
            case 3: /* ADC Clock is derived from APB2/8 */
            RCC_Clocks->ADCCLK_Frequency = (RCC_Clocks->APB2_Frequency /8);
            break;
        }      
    }
    
    /* Get CECCLK clock frequency */
    if((RCC->GCFGR3 & RCC_GCFGR3_CECSEL) != RCC_GCFGR3_CECSEL)
    {        
        /* CEC Clock is derived from HSI/244 */
        RCC_Clocks->CECCLK_Frequency = HSI_VALUE / 244;
    }
    else
    {
        /* CEC Clock is derived from LSE. */
        RCC_Clocks->CECCLK_Frequency = LSE_VALUE;
    }
    
    /* Get USART1CLK clock frequency */
    if((RCC->GCFGR3 & RCC_GCFGR3_USART1SEL) == RCC_USART1CLK_APB2)
    {
        /* USART1 Clock is derived from APB2 */
        RCC_Clocks->USART1CLK_Frequency = RCC_Clocks->APB2_Frequency;
    }
    else if((RCC->GCFGR3 & RCC_GCFGR3_USART1SEL) == RCC_GCFGR3_USART1SEL_0)
    {
        /* USART1 Clock is derived from System Clock */
        RCC_Clocks->USART1CLK_Frequency = RCC_Clocks->CK_SYS_Frequency;
    }
    else if((RCC->GCFGR3 & RCC_GCFGR3_USART1SEL) == RCC_GCFGR3_USART1SEL_1)
    {
        /* USART1 Clock is derived from LSE */
        RCC_Clocks->USART1CLK_Frequency = LSE_VALUE;
    }
    else if((RCC->GCFGR3 & RCC_GCFGR3_USART1SEL) == RCC_GCFGR3_USART1SEL)
    {
        /* USART1 Clock is derived from HSI */
        RCC_Clocks->USART1CLK_Frequency = HSI_VALUE;
    }
}

/**
  * @brief  Enable or disable the AHB peripheral clock.    
  * @param  RCC_AHBPeriph: specify the AHB peripheral clock.
  *   This parameter can be any combination of the following values:
  *     @arg RCC_AHBPERIPH_GPIOA: GPIOA clock
  *     @arg RCC_AHBPERIPH_GPIOB: GPIOB clock
  *     @arg RCC_AHBPERIPH_GPIOC: GPIOC clock
  *     @arg RCC_AHBPERIPH_GPIOD: GPIOD clock
  *     @arg RCC_AHBPERIPH_GPIOF: GPIOF clock
  *     @arg RCC_AHBPERIPH_TSI: TSI clock
  *     @arg RCC_AHBPERIPH_CRC: CRC clock
  *     @arg RCC_AHBPERIPH_FMC: FMC clock
  *     @arg RCC_AHBPERIPH_SRAM: SRAM clock
  *     @arg RCC_AHBPERIPH_DMA1: DMA1 clock
  * @param  NewValue: new state of the peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHBPeriphClock_Enable(uint32_t RCC_AHBPeriph, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->AHBCCR |= RCC_AHBPeriph;
    }
    else
    {
        RCC->AHBCCR &= ~RCC_AHBPeriph;
    }
}

/**
  * @brief  Enable or disable the APB1 peripheral clock.
  * @param  RCC_APB1Periph: specify the APB1 peripheral clock.
  *
  *   For @b GD32F130 or GD32F150 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_APB1PERIPH_TIMER2: TIMER2 clock
  *     @arg RCC_APB1PERIPH_TIMER3: TIMER3 clock
  *     @arg RCC_APB1PERIPH_TIMER6: TIMER6 clock
  *     @arg RCC_APB1PERIPH_TIMER14: TIMER14 clock
  *     @arg RCC_APB1PERIPH_WWDG: WWDG clock
  *     @arg RCC_APB1PERIPH_SPI2: SPI2 clock
  *     @arg RCC_APB1PERIPH_SPI3: SPI3 clock
  *     @arg RCC_APB1PERIPH_USART2: USART2 clock
  *     @arg RCC_APB1PERIPH_I2C1: I2C1 clock
  *     @arg RCC_APB1PERIPH_I2C2: I2C2 clock
  *     @arg RCC_APB1PERIPH_USB: USB clock
  *     @arg RCC_APB1PERIPH_PWR: PWR clock
  *     @arg RCC_APB1PERIPH_DAC: DAC clock
  *     @arg RCC_APB1PERIPH_CEC: CEC clock
  *
  *   For @b GD32F170 or GD32F190 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_APB1PERIPH_TIMER2: TIMER2 clock
  *     @arg RCC_APB1PERIPH_TIMER3: TIMER3 clock
  *     @arg RCC_APB1PERIPH_TIMER6: TIMER6 clock
  *     @arg RCC_APB1PERIPH_TIMER14: TIMER14 clock
  *     @arg RCC_APB1PERIPH_LCD: LCD clock
  *     @arg RCC_APB1PERIPH_WWDG: WWDG clock
  *     @arg RCC_APB1PERIPH_SPI2: SPI2 clock
  *     @arg RCC_APB1PERIPH_SPI3: SPI3 clock
  *     @arg RCC_APB1PERIPH_USART2: USART2 clock
  *     @arg RCC_APB1PERIPH_I2C1: I2C1 clock
  *     @arg RCC_APB1PERIPH_I2C2: I2C2 clock
  *     @arg RCC_APB1PERIPH_CAN1: CAN1 clock
  *     @arg RCC_APB1PERIPH_CAN2: CAN2 clock
  *     @arg RCC_APB1PERIPH_PWR: PWR clock
  *     @arg RCC_APB1PERIPH_DAC: DAC clock
  *     @arg RCC_APB1PERIPH_CEC: CEC clock
  *     @arg RCC_APB1PERIPH_OPAMP: OPAMP clock
  *     @arg RCC_APB1PERIPH_IVREF: IVREF clock 
  *  
  * @param  NewValue: new state of the peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB1PeriphClock_Enable(uint32_t RCC_APB1Periph, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB1CCR |= RCC_APB1Periph;
    }
    else
    {
        RCC->APB1CCR &= ~RCC_APB1Periph;
    }
}

/**
  * @brief  Enable or disable the APB2 peripheral clock.
  * @param  RCC_APB2Periph: specify the APB2 peripheral clock.
  *   This parameter can be any combination of the following values:
  *     @arg RCC_APB2PERIPH_CFG: SYSCFG clock
  *     @arg RCC_APB2PERIPH_CMP: CMP clock
  *     @arg RCC_APB2PERIPH_ADC1: ADC1 clock
  *     @arg RCC_APB2PERIPH_TIMER1: TIMER1 clock
  *     @arg RCC_APB2PERIPH_SPI1: SPI1 clock
  *     @arg RCC_APB2PERIPH_USART1: USART1 clock
  *     @arg RCC_APB2PERIPH_TIMER15: TIMER15 clock
  *     @arg RCC_APB2PERIPH_TIMER16: TIMER16 clock
  *     @arg RCC_APB2PERIPH_TIMER17: TIMER17 clock
  * @param  NewValue: new state of the peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB2PeriphClock_Enable(uint32_t RCC_APB2Periph, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB2CCR |= RCC_APB2Periph;
    }
    else
    {
        RCC->APB2CCR &= ~RCC_APB2Periph;
    }
}

/**
  * @brief  Enable or disable the ACCR_I2C3 peripheral clock.
  * @note   I2C3 Clock is derived from APB1
  * @param  RCC_ACCRPeriph: specify the ACCR_I2C3 peripheral clock.
  *     @arg RCC_ACCRPERIPH_I2C3: I2C3 clock                             
  * @param  NewValue: new state of the peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_ACCRPeriphClock_Enable(uint32_t RCC_ACCRPeriph, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->RCC_I2C3CCR |= RCC_ACCRPeriph;
    }
    else
    {
        RCC->RCC_I2C3CCR &= ~RCC_ACCRPeriph;
    }
}

/**
  * @brief  Enable or disable the RTC clock.
  * @param  NewValue: new state of the RTC clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_RTCCLK_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->BDCR |= RCC_BDCR_RTCEN;
    }
    else
    {
        RCC->BDCR &= ~RCC_BDCR_RTCEN;
    }
}

/**
  * @brief  Force or release AHB peripheral reset.
  * @param  RCC_AHBPeriphRST: specify the AHB peripheral to reset.
  *   This parameter can be any combination of the following values:
  *     @arg RCC_AHBPERIPH_GPIOARST: reset GPIOA clock 
  *     @arg RCC_AHBPERIPH_GPIOBRST: reset GPIOB clock 
  *     @arg RCC_AHBPERIPH_GPIOCRST: reset GPIOC clock 
  *     @arg RCC_AHBPERIPH_GPIODRST: reset GPIOD clock 
  *     @arg RCC_AHBPERIPH_GPIOFRST: reset GPIOF clock 
  *     @arg RCC_AHBPERIPH_TSIRST:   reset TSI clock 
  * @param  NewValue: new state of the peripheral reset.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_AHBPeriphReset_Enable(uint32_t RCC_AHBPeriphRST, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->AHBRCR |= RCC_AHBPeriphRST;
    }
    else
    {
        RCC->AHBRCR &= ~RCC_AHBPeriphRST;
    }
}

/**
  * @brief  Force or release APB2 peripheral reset.
  * @param  RCC_APB2PeriphRST: specifies the APB2 peripheral to reset.
  *   This parameter can be any combination of the following values:
  *     @arg RCC_APB2PERIPH_CFGRST:      reset CFG clock
  *     @arg RCC_APB2PERIPH_CMPRST:      reset CMP clock
  *     @arg RCC_APB2PERIPH_ADC1RST:     reset ADC1 clock
  *     @arg RCC_APB2PERIPH_TIMER1RST:   reset TIM1 clock
  *     @arg RCC_APB2PERIPH_SPI1RST:     reset SPI1 clock
  *     @arg RCC_APB2PERIPH_USART1RST:   reset USART1 clock
  *     @arg RCC_APB2PERIPH_TIMER15RST:  reset TIMER15 clock
  *     @arg RCC_APB2PERIPH_TIMER16RST:  reset TIMER16 clock
  *     @arg RCC_APB2PERIPH_TIMER17RST:  reset TIMER17 clock
  * @param  NewValue: new state of the peripheral reset.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RCC_APB2PeriphReset_Enable(uint32_t RCC_APB2PeriphRST, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB2RCR |= RCC_APB2PeriphRST;
    }
    else
    {
        RCC->APB2RCR &= ~RCC_APB2PeriphRST;
    }
}

/**
  * @brief  Force or release APB1 peripheral reset.
  * @param  RCC_APB1PeriphRST: specifies the APB1 peripheral to reset.
  *
  *   For @b GD32F130 or GD32F150 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_APB1PERIPH_TIMER2RST: reset TIMER2 clock
  *     @arg RCC_APB1PERIPH_TIMER3RST: reset TIMER3 clock
  *     @arg RCC_APB1PERIPH_TIMER6RST: reset TIMER6 clock
  *     @arg RCC_APB1PERIPH_TIMER14RST: reset TIMER14 clock
  *     @arg RCC_APB1PERIPH_WWDGRST: reset WWDG clock
  *     @arg RCC_APB1PERIPH_SPI2RST: reset SPI2 clock
  *     @arg RCC_APB1PERIPH_SPI3RST: reset SPI3 clock
  *     @arg RCC_APB1PERIPH_USART2RST: reset USART2 clock
  *     @arg RCC_APB1PERIPH_I2C1RST: reset I2C1 clock
  *     @arg RCC_APB1PERIPH_I2C2RST: reset I2C2 clock
  *     @arg RCC_APB1PERIPH_USBRST: reset PWR clock
  *     @arg RCC_APB1PERIPH_PWRRST: reset PWR clock
  *     @arg RCC_APB1PERIPH_DACRST: reset DAC clock
  *     @arg RCC_APB1PERIPH_CECRST: reset CEC clock
  *
  *   For @b GD32F170 or GD32F190 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_APB1PERIPH_TIMER2RST: reset TIMER2 clock
  *     @arg RCC_APB1PERIPH_TIMER3RST: reset TIMER3 clock
  *     @arg RCC_APB1PERIPH_TIMER6RST: reset TIMER6 clock
  *     @arg RCC_APB1PERIPH_TIMER14RST: reset TIMER14 clock
  *     @arg RCC_APB1PERIPH_LCDRST: reset LCD clock
  *     @arg RCC_APB1PERIPH_WWDGRST: reset WWDG clock
  *     @arg RCC_APB1PERIPH_SPI2RST: reset SPI2 clock
  *     @arg RCC_APB1PERIPH_SPI3RST: reset SPI3 clock
  *     @arg RCC_APB1PERIPH_USART2RST: reset USART2 clock
  *     @arg RCC_APB1PERIPH_I2C1RST: reset I2C1 clock
  *     @arg RCC_APB1PERIPH_I2C2RST: reset I2C2 clock
  *     @arg RCC_APB1PERIPH_CAN1RST: reset CAN1 clock
  *     @arg RCC_APB1PERIPH_CAN2RST: reset CAN2 clock
  *     @arg RCC_APB1PERIPH_PWRRST: reset PWR clock
  *     @arg RCC_APB1PERIPH_DACRST: reset DAC clock
  *     @arg RCC_APB1PERIPH_CECRST: reset CEC clock
  *     @arg RCC_APB1PERIPH_OPAMPRST: reset OPAMP clock
  *     @arg RCC_APB1PERIPH_IVREFRST: reset IVREF clock
  *
  * @param  NewValue: new state of the peripheral clock (ENABLE or DISABLE).
  * @retval None
  */
void RCC_APB1PeriphReset_Enable(uint32_t RCC_APB1PeriphRST, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->APB1RCR |= RCC_APB1PeriphRST;
    }
    else
    {
        RCC->APB1RCR &= ~RCC_APB1PeriphRST;
    }
}

/**
  * @brief  Force or release ARCR_I2C3 peripheral reset.
  * @param  RCC_ARCRPeriphRST
  *     @arg RCC_ARCRPERIPH_I2C3RST:   reset I2C3 clock
  * @param  NewValue: new state of the peripheral clock (ENABLE or DISABLE).
  * @retval None
  */
void RCC_ARCRPeriphReset_Enable(uint32_t RCC_ARCRPeriphRST, TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->RCC_I2C3RCR |= RCC_ARCRPeriphRST;
    }
    else
    {
        RCC->RCC_I2C3RCR &= ~RCC_ARCRPeriphRST;
    }
}

/**
  * @brief  Force or release the Backup domain reset.
  * @param  NewValue: new state of the Backup domain reset (ENABLE or DISABLE).
  * @retval None
  */
void RCC_BackupReset_Enable(TypeState NewValue)
{
    if (NewValue != DISABLE)
    {
        RCC->BDCR |= RCC_BDCR_BKPRST;
    }
    else
    {
        RCC->BDCR &= ~RCC_BDCR_BKPRST;
    }
}

/**
  * @brief  Enable or disable RCC interrupts.
  * @param  RCC_INT: specify the RCC interrupt sources.
  *
  *   For @b GD32F130 or GD32F150 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_INT_LSISTB: LSI ready interrupt
  *     @arg RCC_INT_LSESTB: LSE ready interrupt
  *     @arg RCC_INT_HSISTB: HSI ready interrupt
  *     @arg RCC_INT_HSESTB: HSE ready interrupt
  *     @arg RCC_INT_PLLSTB: PLL ready interrupt
  *     @arg RCC_INT_HSI14STB: HSI14 ready interrupt  
  *
  *   For @b GD32F170 or GD32F190 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_INT_LSISTB: LSI ready interrupt
  *     @arg RCC_INT_LSESTB: LSE ready interrupt
  *     @arg RCC_INT_HSISTB: HSI ready interrupt
  *     @arg RCC_INT_HSESTB: HSE ready interrupt
  *     @arg RCC_INT_PLLSTB: PLL ready interrupt
  *     @arg RCC_INT_HSI28STB: HSI28 ready interrupt
  *
  * @param  NewValue: new state of the RCC interrupts (ENABLE or DISABLE).
  * @retval None
  */
void RCC_INTConfig(uint8_t RCC_INT, TypeState NewValue)
{  
    if (NewValue != DISABLE)
    {
        /* Perform Byte access to RCC_GCIR[13:8] bits to enable the selected interrupts */
        *(__IO uint8_t *) GCIR_BYTE1_ADDRESS |= RCC_INT;
    }
    else
    {
        /* Perform Byte access to GRCC_GCIR[13:8] bits to disable the selected interrupts */
        *(__IO uint8_t *) GCIR_BYTE1_ADDRESS &= (uint8_t)~RCC_INT;
    }
}

/**
  * @brief  Check whether the specified RCC flag is set or not.
  * @param  RCC_FLAG: specify the flag to check.
  *
  *   For @b GD32F130 or GD32F150 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_FLAG_HSISTB: HSI clock ready  
  *     @arg RCC_FLAG_HSESTB: HSE clock ready
  *     @arg RCC_FLAG_PLLSTB: PLL clock ready
  *     @arg RCC_FLAG_LSESTB: LSE clock ready
  *     @arg RCC_FLAG_LSISTB: LSI clock ready
  *     @arg RCC_FLAG_OBLSTB: Option Byte Loader (OBL) reset 
  *     @arg RCC_FLAG_EPRST: Pin reset
  *     @arg RCC_FLAG_V12RST: V12 power domain reset  
  *     @arg RCC_FLAG_POPDRST: POR/PDR reset
  *     @arg RCC_FLAG_SWRST: Software reset
  *     @arg RCC_FLAG_IWDGRST: Independent Watchdog reset
  *     @arg RCC_FLAG_WWDGRST: Window Watchdog reset
  *     @arg RCC_FLAG_LPRST: Low Power reset
  *     @arg RCC_FLAG_HSI14STB: HSI14 clock ready
  *
  *   For @b GD32F170 or GD32F190 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_FLAG_HSISTB: HSI clock ready  
  *     @arg RCC_FLAG_HSESTB: HSE clock ready
  *     @arg RCC_FLAG_PLLSTB: PLL clock ready
  *     @arg RCC_FLAG_LSESTB: LSE clock ready
  *     @arg RCC_FLAG_LSISTB: LSI clock ready
  *     @arg RCC_FLAG_OBLSTB: Option Byte Loader (OBL) reset 
  *     @arg RCC_FLAG_EPRST: Pin reset
  *     @arg RCC_FLAG_V12RST: V12 power domain reset  
  *     @arg RCC_FLAG_POPDRST: POR/PDR reset
  *     @arg RCC_FLAG_SWRST: Software reset
  *     @arg RCC_FLAG_IWDGRST: Independent Watchdog reset
  *     @arg RCC_FLAG_WWDGRST: Window Watchdog reset
  *     @arg RCC_FLAG_LPRST: Low Power reset
  *     @arg RCC_FLAG_HSI28STB: HSI28 clock ready  
  *  
  * @retval The new state of RCC_FLAG (SET or RESET).
  */
TypeState RCC_GetBitState(uint8_t RCC_FLAG)
{
    uint32_t temp = 0;
    uint32_t statusreg = 0;
    
    /* Get the RCC register index */
    temp = RCC_FLAG >> 5;
    
    
    if (temp == 0)               
    {
        /* The flag to check is in GCCR register */
        statusreg = RCC->GCCR;
    }
    else if (temp == 1)          
    {
        /* The flag to check is in BDCR register */   
        statusreg = RCC->BDCR;
    }
    else if (temp == 2)         
    {
         /* The flag to check is in GCSR register */
        statusreg = RCC->GCSR;
    }
    else                        
    {
        /* The flag to check is in GCR2 register */
        statusreg = RCC->GCCR2;
    }   
    
    /* Get the flag position */
    temp = RCC_FLAG & FLAG_MASK;
    
    if ((statusreg & ((uint32_t)1 << temp)) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/**
  * @brief  Clear the RCC all reset flags.
  * @param  None
  * @retval None
  */
void RCC_ClearBitState(void)
{
    /* Set RSTFC bit to clear all reset flags */
    RCC->GCSR |= RCC_GCSR_RSTFC;
}

