LiteOS/LiteOS/hal/GD32F1x0/FWlib/gd32f1x0_rcc.c
/**
  * @brief  Check whether the RCC interrupt has occurred or not.
  * @param  RCC_INT: specify the RCC interrupt source to check.
  *
  *   For @b GD32F130 or GD32F150 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_INT_LSISTB: the flag of LSI ready interrupt
  *     @arg RCC_INT_LSESTB: the flag of LSE ready interrupt
  *     @arg RCC_INT_HSISTB: the flag of HSI ready interrupt
  *     @arg RCC_INT_HSESTB: the flag of HSE ready interrupt
  *     @arg RCC_INT_PLLSTB: the flag of PLL ready interrupt
  *     @arg RCC_INT_HSI14STB: the flag of HSI14 ready interrupt 
  *     @arg RCC_INT_CKM: the flag of Clock Security System interrupt
  *
  *   For @b GD32F170 or GD32F190 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_INT_LSISTB: the flag of LSI ready interrupt
  *     @arg RCC_INT_LSESTB: the flag of LSE ready interrupt
  *     @arg RCC_INT_HSISTB: the flag of HSI ready interrupt
  *     @arg RCC_INT_HSESTB: the flag of HSE ready interrupt
  *     @arg RCC_INT_PLLSTB: the flag of PLL ready interrupt
  *     @arg RCC_INT_HSI28STB: the flag of HSI28 ready interrupt 
  *     @arg RCC_INT_CKM: the flag of Clock Security System interrupt
  *
  * @retval The new state of RCC_INT (SET or RESET).
  */
TypeState RCC_GetIntBitState(uint8_t RCC_INT)
{  
  /* Check the status of the RCC interrupt */
    if ((RCC->GCIR & RCC_INT) != (uint32_t)RESET)
    {
        return SET;
    }
    else
    {
        return RESET;
    }
}

/**
  * @brief  Clear the RCC interrupt bits.
  * @param  RCC_INT: specify the interrupt bit to clear.
  *
  *   For @b GD32F130 or GD32F150 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_INT_LSISTB: LSI ready interrupt
  *     @arg RCC_INT_LSESTB: LSE ready interrupt
  *     @arg RCC_INT_HSISTB: HSI ready interrupt
  *     @arg RCC_INT_HSESTB: HSE ready interrupt
  *     @arg RCC_INT_PLLSTB: PLL ready interrupt
  *     @arg RCC_INT_HSI14STB: HSI14 ready interrupt  
  *     @arg RCC_INT_CKM: Clock Security System interrupt
  *
  *   For @b GD32F170 or GD32F190 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_INT_LSISTB: LSI ready interrupt
  *     @arg RCC_INT_LSESTB: LSE ready interrupt
  *     @arg RCC_INT_HSISTB: HSI ready interrupt
  *     @arg RCC_INT_HSESTB: HSE ready interrupt
  *     @arg RCC_INT_PLLSTB: PLL ready interrupt
  *     @arg RCC_INT_HSI28STB: HSI28 ready interrupt  
  *     @arg RCC_INT_CKM: Clock Security System interrupt 
  *
  * @retval None
  */
void RCC_ClearIntBitState(uint8_t RCC_INT)
{
    /* Perform Byte access to RCC_GCIR[23:16] bits to clear the selected interrupt bits */
    *(__IO uint8_t *) GCIR_BYTE2_ADDRESS = RCC_INT;
}

/**
  * @brief  Unlock the power.
  * @note   Write 0x1A2B3C4D to RCC_VC_KEY to Unlock the power.
  * @param  None
  * @retval None
  */
void RCC_UnlockPower(void)
{ 
    /* Clear RCC_VC_KEY bit */
    RCC->RCC_VC_KEY &= RCC_VC_KEY_CLEAR;
    /* Unlock the power according to RCC_VC_KEY_ULOCKPOWER */
    RCC->RCC_VC_KEY |= RCC_VC_KEY_ULOCKPOWER;
}

/**
  * @brief  Configure the kernel voltage in Deep-sleep mode.
  * @note   Only unlock the power,this configuration is effective.
  * @param  RCC_KERNEL_VOL: specify the kernel voltage. 
  *
  *   For @b GD32F130 or GD32F150 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_KERNEL_VOL1_2: The kernel voltage in Deep-sleep mode is 1.2V 
  *     @arg RCC_KERNEL_VOL1_1: The kernel voltage in Deep-sleep mode is 1.1V 
  *     @arg RCC_KERNEL_VOL1_0: The kernel voltage in Deep-sleep mode is 1.0V
  *     @arg RCC_KERNEL_VOL0_9: The kernel voltage in Deep-sleep mode is 0.9V
  *
  *   For @b GD32F170 or GD32F190 devices, this parameter can be any combination of 
  *   the following values:
  *     @arg RCC_KERNEL_VOL1_8: The kernel voltage in Deep-sleep mode is 1.8V 
  *     @arg RCC_KERNEL_VOL1_6: The kernel voltage in Deep-sleep mode is 1.6V 
  *     @arg RCC_KERNEL_VOL1_4: The kernel voltage in Deep-sleep mode is 1.4V
  *     @arg RCC_KERNEL_VOL1_2: The kernel voltage in Deep-sleep mode is 1.2V
  *
  * @retval None
  */
void RCC_KERNELVOLConfig(uint32_t RCC_KERNEL_VOL) 
{ 
    /* Clear DEEPSLEEP_VC bit */
    RCC->RCC_DEEPSLEEP_VC &= ~RCC_DEEPSLEEP_VC_CLEAR;
    /* Set DEEPSLEEP_VC bits according to RCC_KERNEL_VOL value */
    RCC->RCC_DEEPSLEEP_VC |= RCC_KERNEL_VOL;
}

#ifdef GD32F130_150
/**
  * @brief  Configure the voltage of power down.
  * @param  RCC_POWERDOWNVOL: specify the voltage of power down.
  *   This parameter can be one of the following values:
  *     @arg RCC_POWERDOWNVOL2_6: The voltage of power down is 2.6V.
  *     @arg RCC_POWERDOWNVOL1_8: The voltage of power down is 1.8V
  * @retval None
  */
void RCC_POWERDOWNVOLConfig(uint32_t RCC_POWERDOWNVOL)
{ 
    /* Clear RCC_PDR_S bit */
    RCC->RCC_PDR_S &= ~RCC_PDR_S_CLEAR;
    /* Set RCC_PDR_S bit according to RCC_POWERDOWNVOL value */
    RCC->RCC_PDR_S |= RCC_POWERDOWNVOL;
}
#endif /* GD32F130_150 */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
